In [2]:
from pandas import Series, DataFrame

import pandas as pd
obj= pd.Series([4,7,-5,3])
print(obj)

0    4
1    7
2   -5
3    3
dtype: int64

# 시리즈

In [6]:
menu = pd.Series(['비빔밥' ,'김치찌개','제육볶음'])
# menu
print(menu)

0     비빔밥
1    김치찌개
2    제육볶음
dtype: object

In [9]:
price=pd.Series([5000,8000,10000])

# 데이터프레임

In [10]:
pd.DataFrame({"메뉴":menu,"가격":price})

     메뉴     가격
0   비빔밥   5000
1  김치찌개   8000
2  제육볶음  10000

In [13]:
df=pd.DataFrame({"메뉴":['피자','햄버거','치킨'],
                 "가격":[20000,30000,25000],
                 "원산지":["국내산","국내산","국내산"]})
df

    메뉴     가격  원산지
0   피자  20000  국내산
1  햄버거  30000  국내산
2   치킨  25000  국내산

In [14]:
df['메뉴']

0     피자
1    햄버거
2     치킨
Name: 메뉴, dtype: object

In [15]:
df[['메뉴']]

    메뉴
0   피자
1  햄버거
2   치킨

# 자료형 비교

# 데이터 저장 및 불러오기

In [19]:
data = {
    '이름': ['Alice', 'Bob', 'Charlie', 'David', 'Eva', 'Frank', 'Grace', 'Hannah', 'Ian', 'Jane'],
    '나이': [25, 30, 22, 28, 35, 27, 24, 31, 29, 26],
    '점수': [85.5, 90.0, 76.5, 88.0, 92.5, 80.0, 73.5, 95.0, 89.5, 84.0]
}


df = pd.DataFrame(data)
df

        이름  나이    점수
0    Alice  25  85.5
1      Bob  30  90.0
2  Charlie  22  76.5
3    David  28  88.0
4      Eva  35  92.5
5    Frank  27  80.0
6    Grace  24  73.5
7   Hannah  31  95.0
8      Ian  29  89.5
9     Jane  26  84.0

In [20]:
df.to_csv('temp.csv')

In [54]:
temp_df=pd.read_csv('temp.csv')
temp_df

df.to_csv('score.csv', index=False)
df1=pd.read_csv('score.csv')
df1

    type size
0  Sedan    M
1    SUV    L
2  Truck    L
3  Sedan    M
4    SUV    L
5  Coupe    S
6  Sedan    M

# 탐색적 데이터 분석(EDA)

## 데이터프레임 샘플확인

In [25]:
df.head(2)

      이름  나이    점수
0  Alice  25  85.5
1    Bob  30  90.0

In [26]:
df.tail(3)

       이름  나이    점수
7  Hannah  31  95.0
8     Ian  29  89.5
9    Jane  26  84.0

In [28]:
df.sample(3)

      이름  나이    점수
1    Bob  30  90.0
5  Frank  27  80.0
4    Eva  35  92.5

# DataFrame의 사이즈 확인

In [30]:
df.shape

(10, 3)

## 컬럼별 자료형 확인

df.info()

## 상관관계

In [36]:
df.corr(numeric_only=True)

          나이        점수
나이  1.000000  0.846747
점수  0.846747  1.000000

In [42]:

data = {
    'car': ['Sedan', 'SUV', 'Truck', 'Sedan', 'SUV', 'Coupe', 'Sedan'],
    'size': ['M', 'L', 'L', 'M', 'L', 'S', 'M']
}

df_car = pd.DataFrame(data)
df_car

     car size
0  Sedan    M
1    SUV    L
2  Truck    L
3  Sedan    M
4    SUV    L
5  Coupe    S
6  Sedan    M

# 고유값의 개수

In [47]:
df_car.nunique()

car     4
size    3
dtype: int64

In [48]:
print(df_car['car'].unique())
print(df_car['size'].unique())

['Sedan' 'SUV' 'Truck' 'Coupe']
['M' 'L' 'S']

In [49]:
print(df_car['car'].value_counts())
print(df_car['size'].value_counts())

car
Sedan    3
SUV      2
Truck    1
Coupe    1
Name: count, dtype: int64
size
M    3
L    3
S    1
Name: count, dtype: int64

In [50]:
df_car.value_counts()

car    size
Sedan  M       3
SUV    L       2
Coupe  S       1
Truck  L       1
Name: count, dtype: int64

In [62]:
df.describe()

         type size
count       7    7
unique      4    3
top     Sedan    M
freq        3    3

In [63]:
## 자료형 변환

In [66]:
data = {
    'car_type': ['SUV', 'Sedan', 'Truck', 'SUV', 'Coupe', 'Sedan', 'Truck', 'SUV', 'Coupe', 'SUV', 'Sedan', 'Truck'],
    'year': [2015, 2018, 2020, 2017, 2019, 2016, 2021, 2022, 2023, 2014, 2013, 2011],
    'price': [25000.5, 18000.0, 32000.99, 27000.0, 15000.75, 17000.0, 34000.5, 30000.0, 16000.0, 29000.0, 19000.5, 31000.0]
}

df = pd.DataFrame(data)
df.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 12 entries, 0 to 11
Data columns (total 3 columns):
 #   Column    Non-Null Count  Dtype
---  ------    --------------  -----
 0   car_type  12 non-null     object
 1   year      12 non-null     int64
 2   price     12 non-null     float64
dtypes: float64(1), int64(1), object(1)
memory usage: 420.0+ bytes

In [ ]:
## 인트로 변환(flaot)

In [ ]:
df['price']=df['price'].astype('int') # and float
df.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 12 entries, 0 to 11
Data columns (total 3 columns):
 #   Column    Non-Null Count  Dtype
---  ------    --------------  -----
 0   car_type  12 non-null     object
 1   year      12 non-null     int64
 2   price     12 non-null     int64
dtypes: int64(2), object(1)
memory usage: 420.0+ bytes

In [69]:
df.head()

  car_type  year  price
0      SUV  2015  25000
1    Sedan  2018  18000
2    Truck  2020  32000
3      SUV  2017  27000
4    Coupe  2019  15000

# 새로운 컬럼 추가

In [71]:
df

   car_type  year  price
0       SUV  2015  25000
1     Sedan  2018  18000
2     Truck  2020  32000
3       SUV  2017  27000
4     Coupe  2019  15000
5     Sedan  2016  17000
6     Truck  2021  34000
7       SUV  2022  30000
8     Coupe  2023  16000
9       SUV  2014  29000
10    Sedan  2013  19000
11    Truck  2011  31000

In [72]:
df['new']=1
df.head()

  car_type  year  price  new
0      SUV  2015  25000    1
1    Sedan  2018  18000    1
2    Truck  2020  32000    1
3      SUV  2017  27000    1
4    Coupe  2019  15000    1

In [73]:
discount=0.2
df['할인가']=df['price']*(1-discount)
df.head()

  car_type  year  price  new      할인가
0      SUV  2015  25000    1  20000.0
1    Sedan  2018  18000    1  14400.0
2    Truck  2020  32000    1  25600.0
3      SUV  2017  27000    1  21600.0
4    Coupe  2019  15000    1  12000.0

## 행이나 컬럼 삭제

In [74]:
df.drop("new", axis=1,inplace=True)

In [76]:
df.head()

  car_type  year  price      할인가
0      SUV  2015  25000  20000.0
1    Sedan  2018  18000  14400.0
2    Truck  2020  32000  25600.0
3      SUV  2017  27000  21600.0
4    Coupe  2019  15000  12000.0

In [77]:
# 인덱싱 / 슬라이싱(loc)